Repository: ThearyCoding/Only-Dev
Catalog: lib/l10n/intl_*.arb
Languages: km

# appTitle
source: E-Learning
km: អេឡិចត្រូនិច

source: Search Courses
km: ស្វែងរកវគ្គសិក្សា

source: Lessons
km: វគ្គសិក្សា

source: Recent Lessons
km: វគ្គសិក្សាថ្មីៗ

source: Popular Lessons
km: វគ្គសិក្សាពេញនិយម

# settingsTitle
source: Settings
km: ការកំណត់

# languageOption
source: Language
km: ភាសា

source: English
km: អង់គ្លេស

source: Khmer
km: ខ្មែរ

source: Edit Profile
km: កែប្រែប្រវត្តិរូប

source: Settings
km: ការកំណត់

source: Notifications
km: ការជូនដំណឹង

source: My Courses
km: មេរៀនរបស់ខ្ញុំ

source: Log Out
km: ចាកចេញ

# errorLoadingUserData
source: Error loading user data. Please try again.
km: មានកំហុសក្នុងការទាញយកទិន្នន័យអ្នកប្រើ។ សូមព្យាយាមម្ដងទៀត។

source: Your Account
km: គណនីរបស់អ្នក

source: App Settings
km: ការកំណត់កម្មវិធី

# notificationsTitle
source: Notifications
km: ការជូនដំណឹង

# myCoursesTitle
source: My Courses
km: មេរៀនរបស់ខ្ញុំ

source: Ongoing
km: កំពុងសិក្សា

source: Downloaded
km: បានទាញយក

source: Completed
km: បានបញ្ចប់

source: No registered courses found.
km: មិនមានវគ្គសិក្សាដែលបានចុះឈ្មោះទេ។

source: No completed courses found.
km: មិនមានវគ្គសិក្សាដែលបានបញ្ចប់ទេ។

# videoRemoved
source: Video removed: {videoTitle}
km: បានលុបវីដេអូ៖ {videoTitle}

# videoNotFound
source: Video not found: {videoTitle}
km: រកមិនឃើញវីដេអូ៖ {videoTitle}

# failedToRemoveVideo
source: Failed to remove video: {error}
km: មិនអាចលុបវីដេអូទេ៖ {error}

source: All Courses
km: គ្រប់វគ្គសិក្សា

# noMoreCoursesToLoad
source: No more courses available to load.
km: មិនមានវគ្គសិក្សាដែលអាចផ្ទុកបានទៀតទេ។

# noCoursesAvailable
source: No Courses available at this time! Pull down to refresh.
km: ពេលនេះមិនមានវគ្គសិក្សាដែលអាចប្រើបានទេ! ទាញចុះដើម្បីបន្ទាន់សម័យ។

source: courses
km: វគ្គសិក្សា

source: Pull down to refresh
km: ទាញចុះដើម្បីបន្ទាន់សម័យ

source: Refresh complete
km: បន្ទាន់សម័យបានជាស្ថាពរ

source: Refresh failed
km: បន្ទាន់សម័យមិនបានសម្រេច

source: Loading more...
km: កំពុងទាញយកបន្ថែម...

# noMoreData
source: No more {noDataText}
km: មិនមាន {noDataText} បន្ថែមទៀតទេ

source: Pull up to load more
km: ទាញឡើងដើម្បីផ្ទុកបន្ថែម

source: Load failed, try again
km: ផ្ទុកមិនបានជោគជ័យ សូមព្យាយាមម្តងទៀត

source: Release to refresh
km: បញ្ចេញដើម្បីបន្ទាន់សម័យ

source: Back
km: ថយក្រោយ

source: No courses found for this category.
km: មិនមានវគ្គសិក្សាសម្រាប់ប្រភេទនេះទេ។

# canLoadingText
source: Release to load more
km: បញ្ចេញដើម្បីទាញយកបន្ថែម

# lectureBy
source: Lecture by {name}
km: បង្រៀនដោយ {name}

source: Lectures
km: មេរៀន

source: students
km: សិស្ស

source: Free
km: ឥតគិតថ្លៃ

source: Enroll Now
km: ចុះឈ្មោះឥឡូវនេះ

source: Coming soon
km: នឹងមកដល់ឆាប់ៗ

source: This course will be available shortly.
km: វគ្គសិក្សានេះនឹងមាននៅឆាប់ៗនេះ។

source: NEW
km: ថ្មីៗ

source: Continue
km: បន្ត

# quiz
source: quizzes
km: លំហាត់

source: No bio available
km: គ្មានប្រវត្តិរូប

# internetConnectionRestored
source: Internet connection is back!
km: ការតភ្ជាប់អ៊ីនធឺណិតត្រឡប់មកវិញ!

# internetConnectionLost
source: Please check your internet connection!
km: សូមពិនិត្យការតភ្ជាប់អ៊ីនធឺណិតរបស់អ្នក!

# logout_title
source: Log Out ?
km: ចាកចេញ ?

# logout_message
source: Are you sure you want to log out ?
km: តើអ្នកប្រាកដថាអ្នកចង់ចាកចេញឬ?

# yes_button
source: Yes
km: បាទ/ចាស

# no_button
source: No Thanks!
km: អត់អីទេ!

source: No notifications
km: មិនមានការជូនដំណឹង

# no_more_notifications
source: No more notification available to load.
km: មិនមានការជូនដំណឹងបន្ថែមទៀតដើម្បីផ្ទុក។

source: Today
km: ថ្ងៃនេះ

source: Earlier
km: មុននេះ

# chooseLanguage
source: Choose Your Language
km: ជ្រើសរើសភាសារបស់អ្នក

# selectAssetsTitle
source: Select Images
km: ជ្រើសរើសរូបភាព
